Revit 2026 API

# SynchronizeWithCentralOptions Class

---

Options to control behavior of synchronization with central.

SystemObject Autodesk.Revit.DBSynchronizeWithCentralOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SynchronizeWithCentralOptions : IDisposable
```
```vb
Public Class SynchronizeWithCentralOptions
	Implements IDisposable
```
```cpp
public ref class SynchronizeWithCentralOptions : IDisposable
```
```fsharp
type SynchronizeWithCentralOptions =
    class
        interface IDisposable
    end
```

The SynchronizeWithCentralOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SynchronizeWithCentralOptions | Constructs a new instance of SynchronizeWithCentralOptions initialized with default options. |

|  | Name | Description |
| --- | --- | --- |
|  | Comment | User description of changes made since the last Sync with Central. Empty by default. |
|  | Compact | Indicates whether Revit should compact the central model while synchronizing with central. This option reduces the size of the central model but many increase the time it takes to perform the save. False by default. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | RelinquishBorrowedElements | Indicates whether Revit should relinquish borrowed elements after synchronizing with central. |
|  | RelinquishFamilyWorksets | Indicates whether Revit should relinquish Family worksets after synchronizing with central. |
|  | RelinquishProjectStandardWorksets | Indicates whether Revit should relinquish Project Standard worksets after synchronizing with central. |
|  | RelinquishUserCreatedWorksets | Indicates whether Revit should relinquish user-created Standard worksets after synchronizing with central. |
|  | RelinquishViewWorksets | Indicates whether Revit should relinquish View worksets after synchronizing with central. |
|  | SaveLocalAfter | True means to save local after saving changes to central. True by default. Silently ignored if the model in the current session is central rather than local. |
|  | SaveLocalBefore | True means to save local before the first reload latest if there are changes not yet saved to local. True by default. Silently ignored if the model in the current session is central rather than local. |
|  | SaveLocalFile | Indicates whether Revit will save the local file at least once while synchronizing with central. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the SynchronizeWithCentralOptions |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetRelinquishOptions | Gets the options which govern whether or not to relinquish elements and workset types. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetRelinquishOptions | Sets the options which govern whether or not to relinquish elements and workset types. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace